# IsEmpty Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPBuildingConstructionSet..::..IsEmpty Property
MEPBuildingConstructionSet Class See Also
---
Test to see if the set is empty.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool IsEmpty { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property IsEmpty As Boolean
	Get
```

Visual C++
---
```text
public:
virtual property bool IsEmpty {
	bool get ();
}
```

# Remarks
If the set is empty then True will be returned, otherwise False.
# See Also
MEPBuildingConstructionSet Class
Autodesk.Revit.DB.Mechanical Namespace